rails_gateway/app/controllers/api/v1/questions_controller.rb

INSERT INTO "request_logs" ("store_id", "question", "response", "success", "error_message", "response_time_ms", "created_at", "updated_at") VALUES ('fry7xk-1v.myshopify.com', 'What were my top selling products last week?', '{"error":"Failed to generate valid query after multiple attempts","details":"400 API key expired. Please renew the API key. [reason: \"API_KEY_INVALID\"\ndomain: \"googleapis.com\"\nmetadata {\n  key: \"service\"\n  value: \"generativelanguage.googleapis.com\"\n}\n, locale: \"en-US\"\nmessage: \"API key expired. Please renew the API key.\"\n]","suggestion":"Try rephrasing your question or being more specific about the time range."}', TRUE, NULL, 3649, '2025-12-26 06:02:18.936498', '2025-12-26 06:02:18.936498') RETURNING "id"
---
      def create
        store_id = params[:store_id]
        question = params[:question]
        start_time = Time.now

        # 1. Validation
        if store_id.blank? || question.blank?
          return render json: { error: "Missing required parameters: store_id, question" }, status: :unprocessable_entity
        end

        # 2. Log Request Start
        Rails.logger.info "Processing question for store #{store_id}: #{question}"

        # 3. Forward to Python AI Service
        response = PythonAiService.ask(store_id, question)
        response_time_ms = ((Time.now - start_time) * 1000).to_i

        # 4. Persist Request Log to Database
        begin
          RequestLog.create!(
            store_id: store_id,
            question: question,
            response: response[:data].to_json,
            success: response[:success],
            error_message: response[:error],
            response_time_ms: response_time_ms
          )